#открытие и закрытие глаз главного героя
init python:
    open = ImageDissolve("eye.png", 2.0, 20, reverse=False)
    close = ImageDissolve("eye.png", 2.0, 20, reverse=True)

# Игра начинается здесь:
label start:

    play music start
    scene black 

    me "И снова я здесь." 
    n "И всё происходит точно также, как и было вчера, позавчера, позапозавчера.." 
    n "Я даже не помню, как попал сюда: на столько я давно тут брожу без цели и выхода отсюда."
    n "Может быть я не существую и бродить по бесконечным коридорам - единственное, что мне осталось?" 

    menu:
        n "Так ли это?"
        "Это не так":
            jump one
        "Мне уже ничего не осталось":
            jump one

    return

label one:
    n "Вопросов много, но никто не поможет мне дать на них ответы."
    extend " Разве что этот кто-то - я сам." 
    n "Тяжелая правда заставляет меня понервничать."

    nvl clear
    
    me "Но, наверное, пора очнуться."
    
    #открывает глаза
    scene bg_hall3 with open

    show genry_laugh at pos3

    G "Всё ещё пытаешься вернуться?"
    hide genry_laugh

    show genry_smile at pos3
    G "По-моему мы тебе объяснили, что ещё никто за всё время существования нас и этого коридора {i}никогда{/i} не выбирался отсюда."
    extend " С чего ты думаешь, что у тебя получится?"

    "Я вас представлю. Этот кот 'хранитель' этого места. На распросы о том, как он тут оказался вместе со мной - ответа не последовало."
    extend " А жаль."
    extend " Я бы хотел разобраться в происходящем, раз выйти отсюда шансов нет."

    me "Не начинай. Я слушал это уже множество раз, но я считаю, что всё возможно, если никто не доказал обратного."
    G "Уверенности тебе не занимать.. Был бы тут Скотт, наверное поддержал бы тебя, но таким меня не впечатлить."
    extend " Скажи, когда действительно всё будет так, как ты и сказал." 

    "Несмотря на свой маленький размер он может со мной так разговаривать, ведь он хозяин этого места, а я.."
    "Что я представляю их себя на данный момент? Кто я без своего статуса студента и студенческого в кармане?"
    extend " А хотелось бы предъявить его Генри и попросить отсрочку от заточения в этом коридоре.."

    "И ведь такое происходит каждый день." 
    extend " За всё время моего пребывания тут я уже и забыл, как день сменяется ночью." 
    " Удивляюсь только тому, что во мне где-то внутри ещё теплится надежда. Или мне так кажется?"

    G "Ладно, я может немного преувеличил, но я этого не хотел. Давай развлечёмся, сыграем с тобой в игру."

    hide genry_smile
    #тут будет игра в поиск предметов
    stop music fadeout 0.5
    jump qwerty
    return

label two:

    scene bg_hall3
    play music start

    if res_game:
        show genry_smile at pos3
        G "А ты молодец! Даже странно для меня это говорить, но ты быстро соображаешь."
    else: 
        show genry_smug at pos3
        G "Если честно, я ожидал большего.."

    G "Ты знаешь, я вижу в тебе потенциал. По крайней мере ты единственный за всё время, с кем я смог повеселиться."

    G "Все, кто был до тебя, не могли и сдвинуться с места." 
    extend " А мне то как скучно.. И никто даже не хочет поиграть со мной.."

    "Интересно, конечно, что из всех возможных существ первого, кого я встретил, стал такой весёлый котик.."

    G "Ты же никуда не торопишься. В чём же причина?"
    me "Думаю, это просто не мой подход к проблеме, в которой я нахожусь сейчас."

    G "Ты интересный парень, хотя и мало говоришь."
    G "Думаю, тебе пора идти дальше, скорее всего мы вскоре снова встретимся, мой друг."

    "Он сказал это с некой долей иронией, явно намекая на что-то намекая. Страшно представить, что товрится у него в голове.."

    stop music fadeout 0.5
    play music steps
    scene bg_hall_4 with dissolve
    pause 0.7
    scene bg_hall_2 with dissolve
    pause 0.7
    scene bg_hall_3 with dissolve
    pause 0.7
    scene bg_hall4 with dissolve

    stop music fadeout 0.5

    "Ну вот, снова я забрёл куда-то. Интересно, здесь есть кто-нибудь?"

    show skot_blank at pos4
    S "Кто тут?"

    "Маленький белый котёнок вышел ко мне. Он выглядит менее грозным, по сравнению с Генри."
    extend " В этом месте только коты водятся что ли.."

    play music little
    show skot_happy at pos4
    S "Привет! Меня зовут Скотт. Давно ко мне не приходили в гости, я очень рад встрече с тобой."

    
    me "Генри уже успел со мной поиграть. Вам не скучно здесь жить в одиночестве?"

    show skot_sad at pos4
    S "Не думаю. У нас, хранителей этого места, не существует понятия 'одиночества'."
    extend " Мы рождены тут и для нас смысл - помогать таким забредшим путникам, как ты."
    me "Много же вы одолжений делаете для остальных.."
    S "Я не такой, как Генри. Для меня твоё внутреннее состояние важнее, чем все те игры, которые он устраивает."
    me "И что же ты хочешь предложить? Снова поиграть в игру?"

    show skot_blank at pos4
    S "Тогда давай так: ты ответишь на некоторые мои вопросы. Если на все ответишь верно, я дам тебе повод для размышления."
    extend " То, что в каком-то смысле может помочь тебе выйти отсюда."
    me "И всё так просто?"
    S "Подвоха нет, есть только моё личное желание помочь и тебе и себе. Но обо всём по порядку. Играем?"
    me "Думаю, у меня нет выбора. Какие вопросы?"

    stop music fadeout 0.5

    jump question
    return

label three:
    stop music
    scene bg_hall4
    show skot_happy at pos4
    S "Всё закончилось, можешь выдохнуть."

    S "Ты оправдал все мои ожидания. Ты не только умный, но и смекалистый паренёк."
    extend " И всё-таки, мы встретились в странный период нашей жизни, если можно так сказать."
    show skot_sad at pos4
    S "Встретились бы при других обстоятельствах, может быть вышло что-то более.."

    "В этот момент я почувствовал, что голова начала сильно болеть."

    window hide

    show layer master at blur(32)
    # фокусируем взгляд
    show layer master at blur(0)
    with dissolve
    # и тут нас начинает колбасить, плющить и таращить
    show layer master at drunk()

    pause 5

    "Я закрыл глаза."

    scene black with close
    play music battle

    nvl clear

    n "Резко нахлынули воспоминания. Всякие разные: о доме, о семье, о школе, университете."
    n "Всё было окрашено в непонятный для меня цвет, смешанный с красным."
    n "Что происходит со мной? Почему как только всё стало хорошо, снова что-то происходит?!"

    nvl clear

    me "Не нравится мне это."
    extend " И от твоих вопросов мне стало только хуже. Я не чувствую чего-то, что было раньше со мной."
    me "Что ты сделал со мной?"

    "Надо попытаться открыть глаза и найти место, где можно спокойно посидеть и отдохнуть."
    scene bg_hall4 with open

    me "Да что такое!? Не стоило вообще доверять никому из них, лучше бы я остался там, на лестнице, один."
    me "И Скотт убежал. Не успел я ему ничего сказать.."

    "Где-то в груди было ощущение, что внутри пусто, как-будто бы там была полая область."
    extend " Может я и не заметил, как меня подменили и.."

    me "К черту эти мысли. Надо найти то, что поможет мне вернуться."

    jump four
    return

label four:

    stop music fadeout 0.5
    play music steps
    scene bg_hall5 with dissolve
    pause 0.7
    scene bg_hall6 with dissolve
    pause 0.7
    scene bg_hall1 with dissolve

    stop music fadeout 0.5

    me "И снова я оказался в неизвестном месте."

    me "Здесь я ещё никогда не был."
    extend " Видимо, мои 'спутники', несмотря на проблемы, которые они приносят, делают и что-то хорошее."
    me "Если вообще это их лап дело."  

    "Я нашел подходящую ступеньку и присел на неё. Думаю, пришло время вспомнить."

    jump qqq
    return

label qqq:

    scene bg_home1 with dissolve
    play music frozen
    # включить режим
    $ tv_on()
    pause 1

    "Что было до всего происходящего сейчас?"
    extend " Где я был, о чём думал и какие цели были у меня в жизни?"
    me "Наверное, я хотел стать таким же трудолюбивым, сильным и отважным как мой отец, и добрым, ответственным как моя мама."
    scene bg_home2 with dissolve
    me "Но куда привели мои стремления? В бесконечные коридоры с неизвестными для меня правилами жизни."
    extend " Или я самом этому причина?"
 
    "Разочарован ли я?"
    extend " 'Я ни в чём не могу разочароваться, поскольку нет ничего такого, чего бы я ожидал', - думал я."
    me "Но так ли это? Уже не совсем.."
    scene bg_home3 with dissolve
    "Чувствую, что когда-то тогда у меня не было целей и мыслей на недалёкое будущее."
    extend " Я думал лишь о том, как провести этот день, без мысли о вчера или завтра."
    scene bg_home4 with dissolve
    "Где-то там была теплота, свет и надежда, которые сыпались из рук из-за нехватки смелости ухватить всё и сразу."
    extend " Дом, родной дом, где веет запахом кошачей шерсти, свежестью и вкусной приготовленной едой."
    "Было и время, когда можно было любоваться природой, гулять допоздна и после валиться на кровать без задних ног.."

    scene bg_home5 with dissolve
    me "Но нужно идти дальше, дальше, не смотря под ноги."
    extend " Дальше, туда, где будет смысл, смысл для чего-то большого и такого нужного." 

    menu:
        me "Точно ли я на правильном пути?"
        "Я так считаю":
            $ h = h+1
        "Это ложь!":
            pass

    # выбор тянется к варианту номер 1, 
    # если же пользователь всё-таки успевает нажать на 2 вариант ответа, 
    # то происходит дополнительный диалог и всё равно выбирается 1 вариант)
    # оставлять эту задумку?

    me "Думаю, в этом месте я не просто так, а для того, чтобы обрести новый смысл и нового себя."
    extend " Cобрать себя по-кусочкам целого и невредимого для новых стремлений и вершин."

    "Скоротав времени на этих холодных и таких сырых ступеньках я решил идти дальше, неважно куда."
    "Пусть даже это будут те же места, в которых я уже бывал бесчисленное количество раз, но идти. И я пошёл.."

    pause .5
    stop music fadeout 0.5
    # отключить режим
    $ tv_off()

    jump five

    return

label five:

    play music steps
    pause 2.0
    scene bg_hall3 with dissolve
    pause 2.0
    stop music fadeout 0.5

    "Я шёл, шёл, и снова пришёл в тот коридор, откуда началось моё недавнее приключение."

    show genry_smirk at pos_g
    show skot_sad at pos_s

    play music memory fadein 5.0

    G "Что ты так долго делал в этом коридоре?"
    extend " Что-то задумываешь против нас?"
    me "Нет. Я хотел с вами ещё поговорить."
    show skot_blank at pos_s
    S "Всё ещё ищешь ответы?"
    me "Ищу, у меня нет другого выбора. Это единственное, чем я могу занять и себя, и вас."
    show genry_laugh at pos_g
    G "Мы с тобой можем играть в разные игры до конца."
    me "Нет, я уже наигрался. Я настроен серьёзно, если ты об этом."

    S "Думаю, мы не сможем как раньше просто убежать и оставить этот разговор на потом, я чувствую его решимость.."
    extend " Она выросла с последнего раза, но.."
    S "Как у тебя получилось вернуть свои воспоминания?"
    show genry_smirk at pos_g
    G "Раз уж разговор зашел так далеко, думаю нет смысла отпираться и врать. Скот, расскажи как есть."

    show skot_sad at pos_s
    S "Я не думал, что ты сможешь это понять, так как люди, приходившие сюда так и пропадали, не возвращая себе важных и нужных воспоминаний." 
    S "А мне они нужны для того, чтобы стать нам с братом такими, какими мы были до прихода в это место!"
    me "Но как можно с помощью чужих воспоминаний вернуть себя?"
    show genry_smug at pos_g
    G "Я тоже ему об этом говорил, но он доказывал обратное.."
    S "Я не просил снова оскорблять меня." 
    G "..."

    S "После множества раз, когда я крал воспоминания, я хранил их в себе, перематывая и пытаясь сам вспомнить о том, кто я и какова причина моего с Генри заточения."
    S "Я пытался вспомнить СЕБЯ. Но.. не получилось. С твоими тоже."
    me "Тогда в чём смысл всего этого?"
    me "От этого поступка никому не стало проще, да и полезной информации тоже никакой."
    G "Мы не можем просто так сидеть сложа лапки и ждать, когда нас кто-то спасёт."
    extend " Мы - те, кто должен помочь себе сам."
    me "Я тоже так думал, до сегодняшнего момента. Но, видимо, я начинаю догадываться, в чём причина.."

    jump six
    return


label six:

    pause 1

    # вместо фона
    scene bg_hall3 at blur(48), brightness(-.2)

    "Сейчас начнётся последняя мини-игра - пятнашки!"
    "Для того чтобы пройти эту игру надо собрать рисунок из всех кусочков, на которые оно разбито."
    "Для удобства можно использовать параметры для показа изображения в прямоульгоной или квадратной форме (КВАДРАТ), или же добавить номер для каждой из такой части (ЧИСЛА)."
    "Эти параметры находятся вверху слева."
    "Если уровень кажется вам сложным и вы не можете его пройти - всегда можно нажать на 'X' и игра закончится."
    "Скоро наша историю закончится, приятной игры и удачи!"

    # вызов игры
    call t15_game("t15 1", 3, 3)

    # выход по кнопке
    if t15_act != "win":
        jump lose

    # ждём клика от игрока
    pause


    return

label lose:

    scene black
    with dissolve

    pause 1

    return

    return